Repository: 84000/data-translation-memory
Catalog: toh48-v4.tmx
Source language: bo
Languages: en

source: སེམས་ཀྱི་བར་དག་ལ་ཉམས་བདེ་བ་མེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་རོ། །
en: If they do not experience pleasure in speech and mind, they are on the third bhūmi.

source: གང་ལ་སྣང་བ་འགའ་ཞིག་ཡོད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་རོ། །
en: If they have some degree of light, they are on the fourth bhūmi.

source: གང་ལ་མི་འཇིགས་པ་ཆུང་བ་དེ་ནི་ས་ལྔ་པར་རོ། །
en: If they have a small degree of fearlessness, they are on the fifth bhūmi.

source: གང་ལ་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་བར་ཆད་ཡོད་པ་དེ་ནི་ས་དྲུག་པར་རོ། །
en: If they have obstacles to what should ripen, they are on the sixth bhūmi.

source: གང་གིས་བསྟན་པ་ལ་བར་ཆད་ཡོད་པ་དེ་ནི་ས་བདུན་པར་རོ། །
en: If they have obstacles to teaching, they are on the seventh bhūmi. 98.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་གྲུ་འདྲེན་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པོ་དག་ཏུ་བལྟ་སྟེ།
en: “Vajrapramardin, if in a dream bodhisattvas perceive themselves piloting a boat, consider those bodhisattvas to be on one of the first the six bhūmis.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་ཐམས་ཅད་ལ་ཆ་མཉམ་པར་སྤྱོད་ཅིང་བར་ཆད་དང་བཅས་པ་ཡིན་པས་དེས་ནི་མི་གནས་པར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་ཐམས་ཅད་ལ་བསྟེན་པར་བྱའོ། །
en: Such bodhisattvas practice the six perfections equally, but do so with obstacles. They should therefore engage all six perfections as being without basis.

source: གྲུའི་ཤིང་མ་སྦྱངས་པ་འདྲེན་པར་ཀུན་ཏུ་ཤེས་ན་ས་དང་པོར་རོ། །
en: “If those bodhisattvas perceive themselves piloting a crude wooden boat, they are on the first bhūmi.

source: སྦྱངས་པས་ནི་ས་གཉིས་པར་རོ།། །།
en: If it is a well-made boat, they are on the second bhūmi.

source: གཤིབས་པས་ནི་ས་གསུམ་པར་རོ། །
en: If the boat is made of planks, they are on the third bhūmi.

source: མ་གཤིབས་པས་ནི་ས་བཞི་པར་རོ། །
en: If it is not made of planks, they are on the fourth bhūmi.

source: སྐྱེ་བོ་ཞུགས་པས་ནི་ས་ལྔ་པར་རོ། །
en: If people are boarding the boat, those bodhisattvas are on the fifth bhūmi.

source: སྒྲོལ་བས་ནི་ས་དྲུག་པར་རོ། །
en: If the boat is being unmoored, they are on the sixth bhūmi. 99.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་སྤྲིན་ལས་འབྲུག་གྲག་པའམ། གློག་འབྱུང་བར་བདག་གིས་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་ལྔ་པོ་དག་ཏུ་བལྟ་སྟེ། །
en: “Vajrapramardin, if in a dream bodhisattvas perceive thunder sounding and lightning shooting from clouds, consider those bodhisattvas to be on one of the first five bhūmis.

source: དེ་ལ་བདུད་ཀྱི་ལས་ནི་ཤས་ཆེ་ལ་ལས་ཀྱི་སྒྲིབ་པ་ནི་ཆུང་བས་དེས་ངེས་པར་བརྟག་པ་མང་དུ་བྱ་ཞིང་སྡུག་པའི་དངོས་པོ་ཡོངས་སུ་བཏང་སྟེ།
en: They are predominated by the activity of Māra, and less influenced by karmic obscurations.

source: གཟུངས་ཡང་དག་པར་བསྒྲུབ་པར་བྱའོ། །
en: They should therefore increase their critical inquiry, give up their beloved objects, and master dhāraṇī.

source: གང་གིས་སྤྲིན་ནམ་གློག་མཐོང་ནས་སྐྲག་ན་དེ་ནི་ས་དང་པོར་རོ། །
en: “If those bodhisattvas become frightened after seeing clouds or lightning, they are on the first bhūmi.

source: གང་མི་སྐྲག་ན་དེ་ནི་ས་གཉིས་པར་རོ། །
en: If they do not become frightened, they are on the second bhūmi.

source: གང་ཆོས་ཡིད་ལ་བྱེད་ན་དེ་ནི་ས་གསུམ་པར་རོ། །
en: If they remain attentive to the Dharma, they are on the third bhūmi.

source: གང་སངས་རྒྱས་ཡིད་ལ་བྱེད་ཅིང་རིའི་རྩེ་མོ་ན་འདུག་ན་དེ་ནི་ས་བཞི་པར་རོ། །
en: If they remain attentive to the Buddha while sitting on a mountain peak, they are on the fourth bhūmi.

source: གང་ནམ་མཁའ་ལ་ན་དེ་ནི་ས་ལྔ་པར་ཏེ།
en: If they are in the sky, they are on the fifth bhūmi.

source: དེ་ལ་བདུད་ཀྱི་ལས་ནི་མ་གཏོགས་སོ། །
en: These are the signs, unless they are the activity of Māra.

source: ཀླུ་འོངས་ཤིང་བྱི་དོར་རམ་སྒོམ་པར་བྱེད་ནས་གོང་མ་དག་ཏུའོ། །
en: If nāgas arrive and start cleaning or practicing, those bodhisattvas are on the higher bhūmis.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་མཚོན་ཆའམ་གོ་ཆ་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་གསུམ་པོ་དག་ཏུ་བལྟ་སྟེ།
en: 100. “Vajrapramardin, if in a dream bodhisattvas find weapons or armor, consider those bodhisattvas to be on one of the first three bhūmis.

source: དེ་ལ་བདུད་ཀྱི་ལས་དང་ལས་ཀྱི་སྒྲིབ་པ་ཆེ་བ་ཡིན་པས་དེས་ནི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཀུན་དུ་བསྟེན་པར་བྱའོ། །
en: They are strongly affected by the activity of Māra and karmic obscurations, and should therefore develop the perfection of patience, the perfection of diligence, and the perfection of insight.

source: གང་གིས་མཚོན་ཆའམ་གོ་ཆ་དྲི་མ་ཅན་རྙེད་ན་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If those bodhisattvas find weapons or armor that has been sullied, consider them to be on the first bhūmi.

source: དྲི་མ་མེད་པས་ནི་ས་གཉིས་པར་རོ། །
en: If unsullied, they are on the second bhūmi.

source: རྣོན་པོས་ནི་ས་གསུམ་པར་རོ། །
en: If they are sharp, they are on the third bhūmi. 101.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་སྣོད་དག་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པོ་དག་ཏུ་བལྟ་སྟེ།
en: “Vajrapramardin, if bodhisattvas find vessels in a dream, consider those bodhisattvas to be on one of the first seven bhūmis.

source: དེས་མཚན་མ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་གདུལ་བར་བྱའོ། །
en: Such bodhisattvas should control themselves as indicated by the signs.

source: དེ་ལ་ནི་བདུད་ཀྱི་ལས་དང་། ལས་ཀྱི་སྒྲིབ་པ་ཡང་མ་ངེས་པ་ཡིན་པས་དེས་བསྡུ་བའི་དངོས་པོ་བཞི་པོ་དག་གིས་མངོན་པར་བརྩོན་པར་བྱའོ། །
en: Because the effect of Māra’s activities and of karmic obscurations is undetermined, they should endeavor in the four means of gathering.

source: ས་དྲུག་པོ་དག་ལ་ནི་ཕྱིར་མི་ལྡོག་པའི་ཆོས་རྣམས་སྤྱད་པར་བྱའོ། །
en: “On the first six bhūmis, those bodhisattvas should train in the irreversible Dharma.

source: ས་བདུན་པ་ལ་ནི་ངའོ་སྙམ་པའི་ང་རྒྱལ་ཤེས་པར་བྱའོ། །
en: On the seventh bhūmi, they should understand egotistic conceit. 102.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་སེམས་ཅན་རྣམས་ལ་ལམ་སྟོན་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཅུ་པོ་ཐམས་ཅད་དུ་འགྱུར་ཏེ།
en: “Vajrapramardin, if in a dream bodhisattvas perceive themselves to be revealing a path to beings, those bodhisattvas are on any of the ten bhūmis.

source: དེས་ལས་ཀྱི་སྒྲིབ་པ་དང་། ཉོན་མོངས་པའི་སྒྲིབ་པའི་དངོས་པོ་ཇི་ལྟ་བ་བཞིན་དུ་རྟོགས་པར་བྱ་ཞིང་ཆོས་སྨྲ་བ་ལ་བསྙེན་བཀུར་བྱ་བ་དང་། དངོས་པོ་ཐམས་ཅད་ཡོངས་སུ་གཏང་བར་བྱ་བ་དང་། བརྩོན་འགྲུས་བརྩམ་པར་ཡང་བྱའོ། །
en: They should try to properly realize the basis of their karmic and afflictive obscurations, serve Dharma teachers, renounce all material things, and privilege diligence.

source: བཞོན་པའི་ལམ་གཙང་མ་སྟོན་ན་ས་དང་པོར་རོ། །
en: “If those bodhisattvas reveal a clear path upon which one may ride an animal, they are on the first bhūmi.

source: སྐྱེད་མོས་ཚལ་གྱི་ལམ་གྱིས་ནི་ས་གཉིས་པར་རོ། །
en: If it is a path in a pleasure garden, they are on the second bhūmi.

source: གྲོང་ཁྱེར་གྱི་ལམ་གྱིས་ནི་ས་གསུམ་པར་རོ། །
en: If it is a city path, they are on the third bhūmi.

source: ལམ་པོ་ཆེས་ནི་ས་བཞི་པར་རོ། །
en: If it is a broad path, they are on the fourth bhūmi.

source: རིའི་ལམ་གྱིས་ནི་ས་ལྔ་པར་རོ། །
en: If it is a mountain path, they are on the fifth bhūmi.

source: རྒྱ་མཚོའི་ལམ་གྱིས་ནི་ས་དྲུག་པར་རོ། །
en: If it is an ocean path, they are on the sixth bhūmi.

source: ལྷའི་ལམ་གྱིས་ནི་ས་བདུན་པར་རོ། །
en: If it is a god’s path, they are on the seventh bhūmi.

source: འདི་ནི་ཉན་ཐོས་ཀྱི་སའི་ལམ་མོ་ཞེས་བྱ་བས་ནི་ས་བརྒྱད་པར་རོ། །
en: If they are told, ‘This is the path of the śrāvaka bhūmis,’ they are on the eighth bhūmi.

source: བྱང་ཆུབ་སེམས་དཔའི་ལམ་གྱིས་ནི་ས་དགུ་པར་རོ། །
en: If it is the bodhisattva path, they are on the ninth bhūmi.

source: སངས་རྒྱས་ཀྱི་ལམ་གྱིས་ནི་ས་བཅུ་པར་ཏེ།
en: If it is a buddha’s path, they are on the tenth bhūmi.

source: ས་དང་པོ་དྲུག་པོ་དག་ལ་བདུད་ཀྱི་ལས་དང་། ལས་ཀྱི་སྒྲིབ་པ་ཡང་རྟོགས་པར་བྱའོ། །
en: You should realize that the signs for the first six bhūmis could be the work of Māra or karmic obscurations.

source: ས་གོང་མ་བཞི་པོ་དག་ལ་ནི་སྐྱོན་དེ་དག་མེད་དོ། །
en: The four higher bhūmis do not have this flaw. 103.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་སྐྱེད་མོས་ཚལ་དུ་ཞུགས་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བརྒྱད་པོ་དག་ཏུ་བལྟ་སྟེ།
en: “Vajrapramardin, if in a dream bodhisattvas perceive themselves to be entering a pleasure garden, consider those bodhisattvas to be on one of the first eight bhūmis.

source: དེའི་རྨི་ལམ་དུ་བདུད་ཀྱི་ལས་དང་། ལས་ཀྱི་སྒྲིབ་པ་དག་རྣམ་པར་སྨིན་པར་འགྱུར་ཞིང་རྨི་ལམ་ན་སྐྲག་པར་ཡང་འགྱུར་ལ།
en: Such bodhisattvas will experience the activity of Māra and the ripening of karmic obscurations in their dreams.

source: དེ་སད་པ་ན་ཡིད་མི་བདེ་བ་ཉམས་སུ་མྱོང་བར་ཡང་འགྱུར་བས། །
en: They will be fearful in their dreams, and feel distressed upon waking.

source: དེས་སྟོང་པ་ཉིད་བསྒོམ་པར་བྱ་ཞིང་ཆོས་ཟབ་མོ་ཡང་མཉན་པར་བྱ། ནང་དུ་ཡང་དག་འཇོག་ཀྱང་གཟུང་བར་བྱ། རྨུག་པ་དང་གཉིད་ཀྱང་སྤང་བར་བྱ། བྱང་ཆུབ་རྣམ་པར་གཏན་ལ་འབེབས་པ་ལ་མཁས་པའི་གང་ཟག་ལ་ཡང་བསྟེན་པར་བྱའོ། །
en: They should therefore train in emptiness, listen to profound teachings, maintain an inward focus, give up dullness and sleepiness, and follow people who are adept at resolving awakening.

source: རྒྱལ་སྲིད་རྣམ་པར་ཉམས་པས་འཇིགས་ན་ས་དང་པོར་རོ། །
en: “If those bodhisattvas are frightened by a deteriorating kingdom, they are on the first bhūmi.

source: ཚུལ་ཁྲིམས་རལ་པས་འཇིགས་ན་ས་གཉིས་པར་རོ། །
en: If they are frightened by failed discipline, they are on the second bhūmi.

source: ཆོས་ནུབ་པས་འཇིགས་ན་ས་གསུམ་པར་རོ། །
en: If they are frightened by the disappearance of the Dharma, they are on the third bhūmi.

source: ཆོས་སྨྲ་བ་འཆི་བས་འཇིགས་ན་ས་བཞི་པར་རོ། །
en: If they are frightened by the death of a Dharma teacher, they are on the fourth bhūmi.

source: མེས་ཚིག་པས་འཇིགས་ན་ས་ལྔ་པར་རོ། །
en: If they are frightened by being burned with fire, they are on the fifth bhūmi.

source: བདག་བསད་པ་དང་འགོ་བའི་ནད་ཀྱིས་འཇིགས་ན་ས་དྲུག་པར་རོ། །
en: If they are frightened by being killed or by infectious disease, they are on the sixth bhūmi.

source: རི་ལས་གཡང་དུ་ལྟུང་བས་འཇིགས་ན་ས་བདུན་པར་རོ། །
en: If they are frightened by falling from a mountain into a chasm, they are on the seventh bhūmi.

source: སྟོན་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བས་འཇིགས་ན་ས་བརྒྱད་པར་ཏེ།
en: If they are frightened by the Teacher passing into final nirvāṇa, they are on the eighth bhūmi.

source: ས་བརྒྱད་པོ་དག་ལ་མངོན་པར་བརྩོན་པ་ལ་བདུད་ཀྱི་ལས་ཀྱང་རྟོགས་པར་བྱའོ། །
en: You should realize that these signs could also be the work of Māra for those who endeavor on the first eight bhūmis.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་ལོ་ཏོག་ཕུན་སུམ་ཚོགས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བརྒྱད་པོ་དག་ཏུ་བལྟ་སྟེ།
en: 104. “Vajrapramardin, if in a dream bodhisattvas see a bountiful harvest, consider those bodhisattvas to be on one of the first eight bhūmis.

source: ས་དང་པོ་ལ་གནས་པས་ས་གཉིས་པ་ལ་མངོན་པར་བརྩོན་པས་དེ་ལྟ་བུར་མཐོང་ན་བདུད་ཀྱི་ལས་ལ་ཡིད་རྟོན་པར་འགྱུར་བའམ། སྔོན་གྱི་རྒྱལ་བ་ལ་བྱ་བ་ལྷག་པར་བྱས་བ་འམ།
en: Bodhisattvas on the first bhūmi who strive for the second bhūmi see signs like this because their minds are steeped in the activity of Māra, because they acted in the service of previous victors, or because they have many obstacles.

source: བར་ཆད་མང་བ་ཡིན་པས་དེས་ནི་འཇིག་རྟེན་ཐམས་ཅད་ལ་རྟེན་པར་མི་བྱ་ཞིང་མི་ལྟ་བར་ཡོངས་སུ་གཏོང་བ་དང་། །རྣམ་པ་གསུམ་ལེགས་པར་བསྡམ་པར་ཡང་བྱའོ། །
en: Such bodhisattvas should not subject themselves to anything worldly, but give them up without a glance and carefully restrain their three aspects.

source: གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་བདག་གམ་ཡོའི་ལོ་ཏོག་ཕུན་སུམ་ཚོགས་པར་མཐོང་ན་དེ་ནི་ས་གསུམ་པར་རོ། །
en: “If those bodhisattvas see a bountiful harvest in their own area, they are on the third bhūmi.

source: གྲོང་གི་ལོ་ཏོག་ཕུན་སུམ་ཚོགས་པར་མཐོང་ན་ས་བཞི་པར་རོ། །
en: If they see a bountiful harvest in a village, they are on the fourth bhūmi.

source: ལྗོངས་ཀྱི་ལོ་ཏོག་ཕུན་སུམ་ཚོགས་པར་མཐོང་ན་ས་ལྔ་པར་རོ། །
en: If they see a bountiful harvest throughout the country, they are on the fifth bhūmi.

source: འཛམ་བུའི་གླིང་གི་ལོ་ཏོག་ཕུན་སུམ་ཚོགས་པར་མཐོང་ན་ས་དྲུག་པར་རོ། །
en: If they see a bountiful harvest throughout Jambudvīpa, they are on the sixth bhūmi.

source: གླིང་བཞི་པའི་ལོ་ཏོག་ཕུན་སུམ་ཚོགས་པར་མཐོང་ན་ས་བདུན་པར་རོ། །
en: If they see a bountiful harvest throughout the four continents, they are on the seventh bhūmi.

source: སྟོང་གསུམ་པའི་ལོ་ཏོག་ཕུན་སུམ་ཚོགས་པར་མཐོང་ན་ས་བརྒྱད་པར་རོ། །
en: If they see a bountiful harvest throughout the trichiliocosm, they are on the eighth bhūmi.

source: ལོ་ཏོག་ཡོངས་སུ་སྨིན་པ་ཕུན་སུམ་ཚོགས་པར་མཐོང་ན་ས་དགུ་པར་རོ། །
en: If they see a bountiful harvest that has fully matured, they are on the ninth bhūmi.

source: དེ་ལ་འཇུག་པར་བྱེད་ན་ས་བཅུ་པར་རོ། །
en: If they are involved with that harvest, they are on the tenth bhūmi.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་སེམས་ཅན་ནད་པ་རྣམས་གསོ་བར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བརྒྱད་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ། །
en: 105. “Vajrapramardin, if in a dream bodhisattvas perceive themselves caring for sick beings, consider those bodhisattvas to be on one of the first eight bhūmis.

source: དེ་ལ་ལས་ཀྱི་སྒྲིབ་པ་ཆུང་ལ་བདུད་ཀྱི་ལས་ཤས་ཆེ་བས་དེས་སྙིང་རྗེ་ཆེན་པོས་ཡོངས་སུ་སྦྱང་བར་བྱ་ཞིང་གཞན་ལ་ཕན་པ་ལ་བརྩོན་པ་དང་། ཕྱིར་རེ་བ་མེད་པར་ཡང་བྱའོ། །
en: Such bodhisattvas possess few karmic obscurations but are dominated by the activity of Māra. They should therefore practice with great compassion and exert themselves in benefiting others without any hope of reciprocity.

source: གང་ཁྱེའུ་གསོ་བར་བྱེད་ན་དེ་ནི་ས་དང་པོར་རོ། །
en: “If those bodhisattvas care for children, they are on the first bhūmi.

source: གང་བུད་མེད་གསོ་བར་བྱེད་ན་དེ་ནི་ས་གཉིས་པར་རོ། །
en: If they care for women, they are on the second bhūmi.

source: གང་མི་ཆེན་པོ་གསོ་བར་བྱེད་ན་དེ་ནི་ས་གསུམ་པར་རོ། །
en: If they care for prominent people, they are on the third bhūmi.

source: གང་རིམས་ཀྱིས་བཏབ་པ་གསོ་བར་བྱེད་ན་དེ་ནི་ས་བཞི་པར་རོ། །
en: If they care for those stricken by fever, they are on the fourth bhūmi.

source: གང་སྐྱེ་རྦབ་ཀྱི་ནད་ཀྱིས་བཏབ་པ་གསོ་བར་བྱེད་ན་དེ་ནི་ས་ལྔ་པར་རོ། །
en: If they care for those stricken by morbid pallor, they are on the fifth bhūmi.

source: གང་ཤ་བཀྲའི་ནད་ཀྱིས་བཏབ་པ་གསོ་བར་བྱེད་ན་དེ་ནི་ས་དྲུག་པར་རོ། །
en: If they treat those stricken by vitiligo, they are on the sixth bhūmi.

source: གང་སྐེམ་ནད་ཀྱིས་བཏབ་པ་གསོ་བར་བྱེད་ན་དེ་ནི་ས་བདུན་པར་རོ། །
en: If they treat those stricken by wasting diseases, they are on the seventh bhūmi.

source: གང་འབྱུང་པོས་ཟིན་པ་གསོ་བར་བྱེད་ན་དེ་ནི་ས་བརྒྱད་པར་ཏེ།
en: If they treat those possessed by bhūtas, they are on the eighth bhūmi.

source: སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེས་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་ལྷག་པའི་བསམ་པ་ཕུན་སུམ་ཚོགས་པར་བྱའོ། །
en: Compassionate bodhisattvas should practice the perfection of patience and cultivate pure motivation.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པའི་སྒྲ་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཅུ་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ། །
en: 106. “Vajrapramardin, if in a dream bodhisattvas hear the words of the prediction that they will awaken, consider those bodhisattvas to be on any of the ten bhūmis.

source: དེས་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལུང་བསྟན་པ་བཅུ་པོ་དག་ཏུ་ཇི་ལྟར་ལུང་བསྟན་པ་ལ་བདུད་ཀྱི་ལས་དང་། ལས་ཀྱི་སྒྲིབ་པ་དག་རྟོགས་པར་བྱའོ། །
en: You should realize that the activity of Māra or karmic obscurations may be responsible for a similar set of ten predictions concerning bodhisattvas.

source: བཅུ་གང་ཞེ་ན།
en: What are the ten?

source: ས་དང་པོ་ལ་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་པ་དང་། ས་གཉིས་པ་ལ་བྱང་ཆུབ་ཀྱི་སྤྱོད་པར་ལུང་སྟོན་པ་དང་། ས་གསུམ་པ་ལ་བཟོད་པར་ལུང་སྟོན་པ་དང་། ། ས་བཞི་པ་ལ་སྨོན་ལམ་དུ་ལུང་སྟོན་པ་དང་། ས་ལྔ་པ་ལ་མཉམ་པ་ཉིད་དུ་ལུང་སྟོན་པ་དང་། ས་དྲུག་པ་ལ་ཡེ་ཤེས་སུ་ལུང་སྟོན་པ་དང་། ས་བདུན་པ་ལ་ཐབས་ལ་མཁས་པར་ལུང་སྟོན་པ་དང་། །ས་བརྒྱད་པ་ལ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱིས་ལས་ཡང་དག་པར་འདས་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ལུང་སྟོན་པ་དང་། ས་དགུ་པ་ལ་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པར་ལུང་སྟོན་པ་དང་། ས་བཅུ་པ་ལ་སངས་རྒྱས་སུ་དབང་བསྐུར་བར་ལུང་སྟོན་པའོ། །
en: On the first bhūmi, a prediction about awakening; on the second bhūmi, a prediction about awakened conduct; on the third bhūmi, a prediction about patience; on the fourth bhūmi, a prediction about aspirations; on the fifth bhūmi, a prediction about impartiality; on the sixth bhūmi, a prediction about wisdom; on the seventh bhūmi, a prediction about skillful means; on the eighth bhūmi, a prediction about omniscience that surpasses the deeds of śrāvakas and pratyekabuddhas; on the ninth bhūmi, a prediction about being just one birth away from awakening; and on the tenth bhūmi, a prediction about receiving confirmation as a buddha.

source: དེས་ནི་སྙིང་རྗེ་ཆེན་པོ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཐབས་ལ་མཁས་པ་ལ་བསྟེན་པར་བྱའོ། །
en: Such bodhisattvas should cultivate great compassion, the perfection of insight, and skillful means.

source: དེས་ན་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །
en: By doing so, they will find release in awakening.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་ཀུན་ཏུ་ཤེས་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ཕྱི་མ་གསུམ་པོ་དག་ཏུ་བལྟ་སྟེ།
en: 107. “Vajrapramardin, if in a dream bodhisattvas perceive themselves to have reached completely perfect buddhahood, consider those bodhisattvas to be on the final three bhūmis.

source: དེས་ནི་བདུད་ཀྱི་ལས་རྟོགས་པར་བྱ་ཞིང་རྟག་ཏུ་མངོན་པར་བརྩོན་པར་ཡང་བྱ་ལྷག་པའི་བསམ་པ་བསྒྲུབ་པར་ཡང་བྱའོ། །
en: They should recognize the activity of Māra, maintain constant effort, and perfect their pure aspirations.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བུམ་པ་གང་བ་རྙེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཅུ་པོ་ཐམས་ཅད་དུ་བལྟའོ། །
en: 108. “Vajrapramardin, if in a dream bodhisattvas perceive themselves finding a full pot, consider those bodhisattvas to be on one of the ten bhūmis.

source: དེས་ན་ཡུལ་ཇི་ལྟ་བ་བཞིན་རྟོགས་པར་བྱ་སྟེ།
en: You should realize that the bhūmi accords with the location of the pot.

source: གལ་ཏེ་གྲོང་ནས་རྙེད་ན་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: If those bodhisattvas find a full pot in a town, consider them to be on the first bhūmi.

source: གལ་ཏེ་སྒོ་ནས་རྙེད་ན་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they find it at a gate, consider them to be on the second bhūmi.

source: གལ་ཏེ་ལམ་ནས་རྙེད་ན་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they find it on a path, consider them to be on the third bhūmi.

source: གལ་ཏེ་ཤིང་དྲུང་ནས་རྙེད་ན་དེ་ནི་ས་བཞི་པར་བལྟའོ། །
en: If they find it near a tree, consider them to be on the fourth bhūmi.

source: གལ་ཏེ་འགྲེང་སྟེ་རྙེད་ན་དེ་ནི་ས་ལྔ་པར་བལྟའོ། །
en: If they find it while standing up, consider them to be on the fifth bhūmi.

source: གལ་ཏེ་འདུག་ཏེ་རྙེད་ན་དེ་ནི་ས་དྲུག་པར་བལྟའོ། །
en: If they find it while sitting down, consider them to be on the sixth bhūmi.

source: གལ་ཏེ་མ་ལ་ནས་རྙེད་ན་དེ་ནི་ས་བདུན་པར་བལྟའོ། །
en: If they find it on a bed, consider them to be on the seventh bhūmi.

source: གལ་ཏེ་ནམ་མཁའ་ལས་རྙེད་ན་དེ་ནི་ས་བརྒྱད་པར་བལྟའོ། །
en: If they find it in the sky, consider them to be on the eighth bhūmi.

source: གལ་ཏེ་ཟས་ཟ་བའི་ཚེ་རྙེད་ན་དེ་ནི་ས་དགུ་པར་བལྟའོ། །
en: If they find it while eating, consider them to be on the ninth bhūmi.

source: གལ་ཏེ་བཞོན་པ་ལ་ཞོན་པ་འམ། །སྐྱེད་མོས་ཚལ་ན་འདུག་པ་ན་རྒྱན་གྱིས་བརྒྱན་པ་རྙེད་ན་དེ་ནི་ས་བཅུ་པར་བལྟ་སྟེ། །
en: If they find a decorated vessel while riding in a carriage or while in a pleasure garden, consider them to be on the tenth bhūmi.

source: བདུད་ཀྱི་ལས་དང་ལས་ཀྱི་སྒྲིབ་པ་ནི་རྟོགས་པར་བྱའོ། །
en: They should recognize what constitutes the activity of Māra and karmic obscurations.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་མཚན་མ་བརྒྱ་རྩ་བརྒྱད་པོ་དེ་དག་གིས་ནི་གང་ཟག་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པ་ཡིན་པར་རིག་པར་བྱ་ཞིང་ཤེས་པར་བྱའོ། །
en: “Vajrapramardin, you should also recognize and understand that these one hundred and eight signs of bodhisattvas refer to people who practice the Bodhisattva Vehicle.”

source: དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ། །
en: Then, at that moment, the Blessed One spoke these verses: “Those who come to possess these signs Are doubtlessly considered great beings.

source: གང་ལ་མཚན་མ་དེ་དག་ཡོད་གྱུར་པ། །དེ་ནི་བདག་ཉིད་ཆེ་བར་ཐེ་ཙོམ་མེད། །
en: Even if little is understood of their conduct, Know their qualities so that faults do not arise.

source: སྤྱོད་པ་ཅུང་ཟད་ཙམ་ཞིག་རྟོགས་གྱུར་ཀྱང་། །ཡོན་ཏན་ཤེས་པས་ཉེས་པ་མ་སྐྱེད་ཅིག །
en: “Fire may blaze forth from the vast ocean, And water may spring from the midst of flame, But I have never seen someone with just one of these signs Reverse their progress to awakening.

source: རྒྱ་མཚོ་ཆེན་པོ་ལས་ནི་མེ་འབར་ཅིང་། །མེ་ཡི་དབུས་ནས་ཆུ་ནི་བྱུང་གྱུར་ཀྱང་། །
en: “Mount Meru can be clutched in a snake’s fangs, And one can visit buddhafields numerous as sand grains in the Gaṅgā.

source: གང་ལ་མཚན་མ་གཅིག་ཙམ་ཡོད་གྱུར་པ། །དེ་ནི་བྱང་ཆུབ་ཕྱིར་ལྡོག་ངས་མ་མཐོང་། །
en: Such things are indeed possible, But one with these signs will not turn from the mind of awakening.

source: སྡིག་སྦྲུལ་སོས་ནི་ལྷུན་པོ་བཟུང་གྱུར་ཅིང་། །གང་གཱའི་བྱེ་སྙེད་ཞིང་དུ་འགྲོ་གྱུར་ཀྱང་། །
en: “Even if their conduct seems at odds with the bhūmis, They have not regressed from awakening at all.

source: དེ་འདྲའི་བྱེད་རྒྱུ་དེ་དག་ཡོད་པར་ནི། །བྱང་ཆུབ་སེམས་ལས་ཕྱིར་ལྡོག་ཡོད་མ་ཡིན། །
en: No matter how meager a person’s good qualities, They will reach awakening if moved by pure motivation.

source: སྤྱོད་པས་ས་ལས་ལོག་པར་སྣང་གྱུར་ཀྱང་། །འདི་ལ་བྱང་ཆུབ་ཕྱིར་ལྡོག་འགའ་ཡང་མེད། །
en: “The realm of space, and likewise the realm of beings; The wisdom of the buddhas, and likewise the mind of awakening— Each of these four is beyond measure, Entirely impossible for worldly people to comprehend.

source: གང་ཟག་ཇི་ཙམ་ཡོན་ཏན་ཆུང་བས་ཀྱང་། །ལྷག་པའི་བསམ་པས་བསྐྱོད་ན་བྱང་ཆུབ་འཐོབ། །
en: “That which is recognized as the conduct of a bodhisattva Should be known as the result of aspirations.

source: ནམ་མཁའི་ཁམས་དང་དེ་བཞིན་སེམས་ཅན་ཁམས། །སངས་རྒྱས་ཡེ་ཤེས་དེ་བཞིན་བྱང་ཆུབ་སེམས། །ཆོས་བཞི་གང་ཡིན་དེ་དག་ཚད་མེད་དེ། །དེ་དག་འཇིག་རྟེན་ཀུན་གྱིས་རྟོགས་མི་ནུས། །
en: Trying to fathom the inconceivable behavior of beings Is like measuring the ocean with a blade of grass.

source: གང་དག་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་རྟོགས་པ། །དེ་དག་སྨོན་པ་ཡིན་པར་ཤེས་པར་བྱ། ། སེམས་ཅན་སྤྱོད་པ་བསམ་ཡས་སེམས་བྱེད་པ། །གང་ཞིག་རྩྭ་ཡིས་རྒྱ་མཚོ་གཏིང་དཔོག་བཞིན། །
en: “It easier for a person who wants to live To drink from a sea of molten metal Than for a bodhisattva to be harsh; For them the suffering would be unfathomable.

source: གང་ཟག་འཚོ་བར་འདོད་པས་ལྕགས་བཞུན་གྱི། །རྒྱ་མཚོ་ཆེན་པོ་འཐུང་བར་བྱེད་སླ་ཡི། །བྱང་ཆུབ་སེམས་དཔའ་ཐ་བ་མི་སྐྱེད་དེ། །དེ་ཡི་སྡུག་བསྔལ་དེ་ལ་གྲངས་ཀྱང་མེད། །
en: “Any ordinary person wishing to be happy, Whoever they may be, should not get angry With those who are obscured by karma, Or who are vexed by Māra.

source: འགའ་ཞིག་ལས་ཀྱིས་བསྒྲིབས་པར་གྱུར་པའམ། །ཡང་ན་བདུད་ཀྱིས་ཀུན་ཏུ་དཀྲུགས་གྱུར་པ། །དེ་ལ་གང་ཟག་ཕལ་པ་བདེ་འདོད་པ། །སུས་ཀྱང་ཁོང་ནི་ཁྲོ་བར་མི་བྱའོ། །མདོག་ངན་གླེན་ནམ་ཡང་ན་རྙེད་མེད་དམ། །བརྙས་ཤིང་སྨད་པར་བྱ་བ་ཡིན་ན་ཡང་། །མི་ཡི་ཁམས་དང་སྤྱོད་པ་ཤེས་དཀའ་བས། །དེ་ལ་གྱ་ཚོམ་སྐྱོན་ནི་གདགས་མི་བྱ། །
en: “Even though it is possible to belittle and revile The ugly, the dumb, and even the poor, It is hard to understand a person’s character and conduct, So do not judge their flaws rashly.

source: ཤཱ་རིའི་བུ་དབེན་འདུག་སྟེ་སྒོམ་པ་ན། དེས་ནི་སེམས་ཀྱི་སྐད་ཅིག་ལྔ་བཅུ་རྟོགས། །
en: “It is said that when Śāriputra sits alone and practices, His realization consists of fifty moments of thought.

source: སྟོན་པས་སྐད་ཅིག་གཅིག་ལ་ཚད་མེད་སེམས། །མཁྱེན་པས་དེ་ལ་སོམ་ཉི་མ་བྱེད་གསུངས། །
en: The Teacher’s mind is limitless in a single moment of thought; The wise have no ambivalence about this.

source: དགྲ་བཅོམ་ཀུན་གྱིས་རང་ཁམས་མི་ཤེས་ན། །སེམས་ཅན་སྤྱོད་པ་ཤེས་པ་སྨོས་ཅི་དགོས། །
en: “If no arhat understands their own nature, How can they understand the behavior of beings?

source: ངས་ནི་སྐད་ཅིག་ཙམ་གྱིས་གཞན་ཤེས་པས། །གང་ཟག་དེ་ལ་བརྙས་པར་མ་བྱེད་ཅིག །
en: I fully understand others in a mere instant, So do not belittle those beings.

source: འདོད་ཆགས་བྲལ་བས་གོས་དམར་བླངས་ནས་ནི། །གྱོན་པར་བྱེད་ཅིང་དེ་བཞིན་མྱུར་དུ་ནི། །སྐད་ཅིག་འཇིག་པར་འགྱུར་བ་ངས་མཐོང་བས། །
en: “I have seen people free of desire Receive the red robes, put them on, And then just as quickly, in just a moment, fail.
